<?php
ini_set('display_errors', "On");
/* ------------------------------------------------
テンプレートフォルダのパス
--------------------------------------------------- */
$path = dirname(__FILE__).'/';
set_include_path(get_include_path() . PATH_SEPARATOR . $path);


/* ------------------------------------------------
vite manifest.json取得
--------------------------------------------------- */
$url = $path . "../assets/dist/manifest.json";
$json = file_get_contents($url);
$arr = json_decode($json,TRUE);


/* ------------------------------------------------
vite 開発サーバー
--------------------------------------------------- */
$vite_dev = 'http://127.0.0.1:5173';
$vite_dev_context = stream_context_create(array(
    'http' => array('ignore_errors' => true)
));
$vite_dev_fp = @fopen($vite_dev . '/@vite/client', 'r');


/* ------------------------------------------------
メタ情報
--------------------------------------------------- */
//サイト名
$siteTitle = "";

//サイト説明文
$siteDescription = "";

//キーワード
$siteKeywords = "";


/* ------------------------------------------------
ルートフォルダ設定
--------------------------------------------------- */
$root = ""; // rootフォルダを設定する場合は先頭に/をつける ex) /root


/* ------------------------------------------------
ID
--------------------------------------------------- */
$twitterId = ""; //twitterID




?>